"use strict";
class _WuXingGanZhiSystem_ {
    constructor() {
        this.wuXing = new Array(['0', '木', '火', '土', '金', '水', '春', '夏', '季', '秋', '冬', ''], ['1', '火', '土', '金', '水', '木', '夏', '季', '秋', '冬', '春', ''], ['2', '土', '金', '水', '木', '火', '季', '秋', '冬', '春', '夏', ''], ['3', '金', '水', '木', '火', '土', '秋', '冬', '春', '夏', '季', ''], ['4', '水', '木', '火', '土', '金', '冬', '春', '夏', '季', '秋', '']);
        this.tianGan = new Array(['1', '甲', '0', '木', '己', '土', '太過', '庚', '辰', '戌', '丑', '未'], ['2', '乙', '1', '木', '庚', '金', '不及', '辛', '巳', '酉', '丑', '申'], ['3', '丙', '0', '火', '辛', '水', '太過', '壬', '申', '子', '辰', '亥'], ['4', '丁', '1', '火', '壬', '木', '不及', '癸', '亥', '卯', '未', '寅'], ['5', '戊', '0', '土', '癸', '火', '太過', '', '寅', '午', '戌', '巳'], ['6', '己', '1', '土', '甲', '土', '不及', '', '辰', '戌', '丑', '未'], ['7', '庚', '0', '金', '乙', '金', '太過', '甲', '巳', '酉', '丑', '申'], ['8', '辛', '1', '金', '丙', '水', '不及', '乙', '申', '子', '辰', '亥'], ['9', '壬', '0', '水', '丁', '木', '太過', '丙', '亥', '卯', '未', '寅'], ['10', '癸', '1', '水', '戊', '火', '不及', '丁', '寅', '午', '戌', '巳']);
        this.diZhi = new Array(['1', '子', '0', '水', '丑', '土', '未', '午', '酉', '申', '辰', '亥', '丑'], ['2', '丑', '1', '土', '子', '土', '午', '未', '辰', '酉', '巳', '子', '亥'], ['3', '寅', '0', '木', '亥', '木', '巳', '申', '亥', '午', '戌', '卯', '辰'], ['4', '卯', '1', '木', '戌', '火', '辰', '酉', '午', '亥', '未', '寅', '辰'], ['5', '辰', '0', '土', '酉', '金', '卯', '戌', '丑', '子', '申', '卯', '寅'], ['6', '巳', '1', '火', '申', '水', '寅', '亥', '申', '酉', '丑', '午', '未'], ['7', '午', '0', '火', '未', '火日月', '丑', '子', '卯', '寅', '戌', '巳', '未'], ['8', '未', '1', '土', '午', '火日月', '子', '丑', '戌', '卯', '亥', '巳', '午'], ['9', '申', '0', '金', '巳', '水', '亥', '寅', '巳', '子', '辰', '酉', '戌'], ['10', '酉', '1', '金', '辰', '金', '戌', '卯', '子', '巳', '丑', '申', '亥'], ['11', '戌', '0', '土', '卯', '火', '酉', '辰', '未', '午', '寅', '酉', '申'], ['12', '亥', '1', '水', '寅', '木', '申', '巳', '寅', '卯', '未', '子', '丑']);
        this.ganZhi = new Array(['1', '甲子', '0', '甲', '1', '子', '1', '海中', '金', '1', '戌', '11', '亥', '12', '', '', ''], ['2', '乙丑', '1', '乙', '2', '丑', '2', '海中', '金', '1', '戌', '11', '亥', '12', '', '', ''], ['3', '丙寅', '0', '丙', '3', '寅', '3', '炉中', '火', '1', '戌', '11', '亥', '12', '', '', ''], ['4', '丁卯', '1', '丁', '4', '卯', '4', '炉中', '火', '1', '戌', '11', '亥', '12', '', '', ''], ['5', '戊辰', '0', '戊', '5', '辰', '5', '大林', '木', '1', '戌', '11', '亥', '12', '', '', ''], ['6', '己巳', '1', '己', '6', '巳', '6', '大林', '木', '1', '戌', '11', '亥', '12', '', '', ''], ['7', '庚午', '0', '庚', '7', '午', '7', '路旁', '土', '1', '戌', '11', '亥', '12', '', '', ''], ['8', '辛未', '1', '辛', '8', '未', '8', '路旁', '土', '1', '戌', '11', '亥', '12', '', '', ''], ['9', '壬申', '0', '壬', '9', '申', '9', '剑锋', '金', '1', '戌', '11', '亥', '12', '', '', ''], ['10', '癸酉', '1', '癸', '10', '酉', '10', '剑锋', '金', '1', '戌', '11', '亥', '12', '', '', ''], ['11', '甲戌', '0', '甲', '1', '戌', '11', '山头', '火', '2', '申', '9', '酉', '10', '', '', ''], ['12', '乙亥', '1', '乙', '2', '亥', '12', '山头', '火', '2', '申', '9', '酉', '10', '', '', ''], ['13', '丙子', '0', '丙', '3', '子', '1', '涧下', '水', '2', '申', '9', '酉', '10', '', '', ''], ['14', '丁丑', '1', '丁', '4', '丑', '2', '涧下', '水', '2', '申', '9', '酉', '10', '', '', ''], ['15', '戊寅', '0', '戊', '5', '寅', '3', '城墙', '土', '2', '申', '9', '酉', '10', '', '', ''], ['16', '己卯', '1', '己', '6', '卯', '4', '城墙', '土', '2', '申', '9', '酉', '10', '', '', ''], ['17', '庚辰', '0', '庚', '7', '辰', '5', '白腊', '金', '2', '申', '9', '酉', '10', '', '', ''], ['18', '辛巳', '1', '辛', '8', '巳', '6', '白腊', '金', '2', '申', '9', '酉', '10', '', '', ''], ['19', '壬午', '0', '壬', '9', '午', '7', '杨柳', '木', '2', '申', '9', '酉', '10', '', '', ''], ['20', '癸未', '1', '癸', '10', '未', '8', '杨柳', '木', '2', '申', '9', '酉', '10', '', '', ''], ['21', '甲申', '0', '甲', '1', '申', '9', '泉中', '水', '3', '午', '7', '未', '8', '', '', ''], ['22', '乙酉', '1', '乙', '2', '酉', '10', '泉中', '水', '3', '午', '7', '未', '8', '', '', ''], ['23', '丙戌', '0', '丙', '3', '戌', '11', '屋上', '土', '3', '午', '7', '未', '8', '', '', ''], ['24', '丁亥', '1', '丁', '4', '亥', '12', '屋上', '土', '3', '午', '7', '未', '8', '', '', ''], ['25', '戊子', '0', '戊', '5', '子', '1', '霹雳', '火', '3', '午', '7', '未', '8', '', '', ''], ['26', '己丑', '1', '己', '6', '丑', '2', '霹雳', '火', '3', '午', '7', '未', '8', '', '', ''], ['27', '庚寅', '0', '庚', '7', '寅', '3', '松柏', '木', '3', '午', '7', '未', '8', '', '', ''], ['28', '辛卯', '1', '辛', '8', '卯', '4', '松柏', '木', '3', '午', '7', '未', '8', '', '', ''], ['29', '壬辰', '0', '壬', '9', '辰', '5', '長流', '水', '3', '午', '7', '未', '8', '', '', ''], ['30', '癸巳', '1', '癸', '10', '巳', '6', '長流', '水', '3', '午', '7', '未', '8', '', '', ''], ['31', '甲午', '0', '甲', '1', '午', '7', '砂中', '金', '4', '辰', '5', '巳', '6', '', '', ''], ['32', '乙未', '1', '乙', '2', '未', '8', '砂中', '金', '4', '辰', '5', '巳', '6', '', '', ''], ['33', '丙申', '0', '丙', '3', '申', '9', '山下', '火', '4', '辰', '5', '巳', '6', '', '', ''], ['34', '丁酉', '1', '丁', '4', '酉', '10', '山下', '火', '4', '辰', '5', '巳', '6', '', '', ''], ['35', '戊戌', '0', '戊', '5', '戌', '11', '平地', '木', '4', '辰', '5', '巳', '6', '', '', ''], ['36', '己亥', '1', '己', '6', '亥', '12', '平地', '木', '4', '辰', '5', '巳', '6', '', '', ''], ['37', '庚子', '0', '庚', '7', '子', '1', '壁上', '土', '4', '辰', '5', '巳', '6', '', '', ''], ['38', '辛丑', '1', '辛', '8', '丑', '2', '壁上', '土', '4', '辰', '5', '巳', '6', '', '', ''], ['39', '壬寅', '0', '壬', '9', '寅', '3', '金箔', '金', '4', '辰', '5', '巳', '6', '', '', ''], ['40', '癸卯', '1', '癸', '10', '卯', '4', '金箔', '金', '4', '辰', '5', '巳', '6', '', '', ''], ['41', '甲辰', '0', '甲', '1', '辰', '5', '佛灯', '火', '5', '寅', '3', '卯', '4', '', '', ''], ['42', '乙巳', '1', '乙', '2', '巳', '6', '佛灯', '火', '5', '寅', '3', '卯', '4', '', '', ''], ['43', '丙午', '0', '丙', '3', '午', '7', '天河', '水', '5', '寅', '3', '卯', '4', '', '', ''], ['44', '丁未', '1', '丁', '4', '未', '8', '天河', '水', '5', '寅', '3', '卯', '4', '', '', ''], ['45', '戊申', '0', '戊', '5', '申', '9', '大驿', '土', '5', '寅', '3', '卯', '4', '', '', ''], ['46', '己酉', '1', '己', '6', '酉', '10', '大驿', '土', '5', '寅', '3', '卯', '4', '', '', ''], ['47', '庚戌', '0', '庚', '7', '戌', '11', '钗钏', '金', '5', '寅', '3', '卯', '4', '', '', ''], ['48', '辛亥', '1', '辛', '8', '亥', '12', '钗钏', '金', '5', '寅', '3', '卯', '4', '', '', ''], ['49', '壬子', '0', '壬', '9', '子', '1', '桑松', '木', '5', '寅', '3', '卯', '4', '', '', ''], ['50', '癸丑', '1', '癸', '10', '丑', '2', '桑松', '木', '5', '寅', '3', '卯', '4', '', '', ''], ['51', '甲寅', '0', '甲', '1', '寅', '3', '大溪', '水', '6', '子', '1', '丑', '2', '', '', ''], ['52', '乙卯', '1', '乙', '2', '卯', '4', '大溪', '水', '6', '子', '1', '丑', '2', '', '', ''], ['53', '丙辰', '0', '丙', '3', '辰', '5', '砂中', '土', '6', '子', '1', '丑', '2', '', '', ''], ['54', '丁巳', '1', '丁', '4', '巳', '6', '砂中', '土', '6', '子', '1', '丑', '2', '', '', ''], ['55', '戊午', '0', '戊', '5', '午', '7', '天上', '火', '6', '子', '1', '丑', '2', '', '', ''], ['56', '己未', '1', '己', '6', '未', '8', '天上', '火', '6', '子', '1', '丑', '2', '', '', ''], ['57', '庚申', '0', '庚', '7', '申', '9', '石榴', '木', '6', '子', '1', '丑', '2', '', '', ''], ['58', '辛酉', '1', '辛', '8', '酉', '10', '石榴', '木', '6', '子', '1', '丑', '2', '', '', ''], ['59', '壬戌', '0', '壬', '9', '戌', '11', '大海', '水', '6', '子', '1', '丑', '2', '', '', ''], ['60', '癸亥', '1', '癸', '10', '亥', '12', '大海', '水', '6', '子', '1', '丑', '2', '', '', '']);
        this.byYear2MonthZhuNameArr = new Array(['丙子', '丁丑', '丙寅', '丁卯', '戊辰', '己巳', '庚午', '辛未', '壬申', '癸酉', '甲戌', '乙亥'], ['戊子', '己丑', '戊寅', '己卯', '庚辰', '辛巳', '壬午', '癸未', '甲申', '乙酉', '丙戌', '丁亥'], ['庚子', '辛丑', '庚寅', '辛卯', '壬辰', '癸巳', '甲午', '乙未', '丙申', '丁酉', '戊戌', '己亥'], ['壬子', '癸丑', '壬寅', '癸卯', '甲辰', '乙巳', '丙午', '丁未', '戊申', '己酉', '庚戌', '辛亥'], ['甲子', '乙丑', '甲寅', '乙卯', '丙辰', '丁巳', '戊午', '己未', '庚申', '辛酉', '壬戌', '癸亥'], ['丙子', '丁丑', '丙寅', '丁卯', '戊辰', '己巳', '庚午', '辛未', '壬申', '癸酉', '甲戌', '乙亥'], ['戊子', '己丑', '戊寅', '己卯', '庚辰', '辛巳', '壬午', '癸未', '甲申', '乙酉', '丙戌', '丁亥'], ['庚子', '辛丑', '庚寅', '辛卯', '壬辰', '癸巳', '甲午', '乙未', '丙申', '丁酉', '戊戌', '己亥'], ['壬子', '癸丑', '壬寅', '癸卯', '甲辰', '乙巳', '丙午', '丁未', '戊申', '己酉', '庚戌', '辛亥'], ['甲子', '乙丑', '甲寅', '乙卯', '丙辰', '丁巳', '戊午', '己未', '庚申', '辛酉', '壬戌', '癸亥']);
        this.byYear2MonthZhuNoArr = new Array(['13', '14', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12'], ['25', '26', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24'], ['37', '38', '27', '28', '29', '30', '31', '32', '33', '34', '35', '36'], ['49', '50', '39', '40', '41', '42', '43', '44', '45', '46', '47', '48'], ['1', '2', '51', '52', '53', '54', '55', '56', '57', '58', '59', '60'], ['13', '14', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12'], ['25', '26', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24'], ['37', '38', '27', '28', '29', '30', '31', '32', '33', '34', '35', '36'], ['49', '50', '39', '40', '41', '42', '43', '44', '45', '46', '47', '48'], ['1', '2', '51', '52', '53', '54', '55', '56', '57', '58', '59', '60']);
        this.byDay2TimeZhuNameArr = new Array(['甲子', '乙丑', '丙寅', '丁卯', '戊辰', '己巳', '庚午', '辛未', '壬申', '癸酉', '甲戌', '乙亥'], ['丙子', '丁丑', '戊寅', '己卯', '庚辰', '辛巳', '壬午', '癸未', '甲申', '乙酉', '丙戌', '丁亥'], ['戊子', '己丑', '庚寅', '辛卯', '壬辰', '癸巳', '甲午', '乙未', '丙申', '丁酉', '戊戌', '己亥'], ['庚子', '辛丑', '壬寅', '癸卯', '甲辰', '乙巳', '丙午', '丁未', '戊申', '己酉', '庚戌', '辛亥'], ['壬子', '癸丑', '甲寅', '乙卯', '丙辰', '丁巳', '戊午', '己未', '庚申', '辛酉', '壬戌', '癸亥'], ['甲子', '乙丑', '丙寅', '丁卯', '戊辰', '己巳', '庚午', '辛未', '壬申', '癸酉', '甲戌', '乙亥'], ['丙子', '丁丑', '戊寅', '己卯', '庚辰', '辛巳', '壬午', '癸未', '甲申', '乙酉', '丙戌', '丁亥'], ['戊子', '己丑', '庚寅', '辛卯', '壬辰', '癸巳', '甲午', '乙未', '丙申', '丁酉', '戊戌', '己亥'], ['庚子', '辛丑', '壬寅', '癸卯', '甲辰', '乙巳', '丙午', '丁未', '戊申', '己酉', '庚戌', '辛亥'], ['壬子', '癸丑', '甲寅', '乙卯', '丙辰', '丁巳', '戊午', '己未', '庚申', '辛酉', '壬戌', '癸亥']);
        this.byDay2TimeZhuNoArr = new Array([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12], [13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24], [25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36], [37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48], [49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60], [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12], [13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24], [25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36], [37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48], [49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60]);
        this.ganShenTB = new Array(['0', '甲', '比', '劫', '梟', '印', '殺', '官', '才', '財', '食', '傷'], ['1', '乙', '劫', '比', '印', '梟', '官', '殺', '財', '才', '傷', '食'], ['2', '丙', '食', '傷', '比', '劫', '梟', '印', '殺', '官', '才', '財'], ['3', '丁', '傷', '食', '劫', '比', '印', '梟', '官', '殺', '財', '才'], ['4', '戊', '才', '財', '食', '傷', '比', '劫', '梟', '印', '殺', '官'], ['5', '己', '財', '才', '傷', '食', '劫', '比', '印', '梟', '官', '殺'], ['6', '庚', '殺', '官', '才', '財', '食', '傷', '比', '劫', '梟', '印'], ['7', '辛', '官', '殺', '財', '才', '傷', '食', '劫', '比', '印', '梟'], ['8', '壬', '梟', '印', '殺', '官', '才', '財', '食', '傷', '比', '劫'], ['9', '癸', '印', '梟', '官', '殺', '財', '才', '傷', '食', '劫', '比']);
        this.zhiShenTB = new Array(['0', '子', '印', '梟', '官', '殺', '財', '才', '傷', '食', '劫', '比'], ['1', '丑', '財', '才', '傷', '食', '劫', '比', '印', '梟', '官', '殺'], ['2', '寅', '比', '劫', '梟', '印', '殺', '官', '才', '財', '食', '傷'], ['3', '卯', '劫', '比', '印', '梟', '官', '殺', '財', '才', '傷', '食'], ['4', '辰', '才', '財', '食', '伤', '比', '劫', '梟', '印', '殺', '官'], ['5', '巳', '食', '傷', '比', '劫', '梟', '印', '殺', '官', '才', '財'], ['6', '午', '傷', '食', '劫', '比', '印', '梟', '官', '殺', '財', '才'], ['7', '未', '財', '才', '傷', '食', '劫', '比', '印', '梟', '官', '殺'], ['8', '申', '殺', '官', '才', '財', '食', '傷', '比', '劫', '梟', '印'], ['9', '酉', '官', '殺', '財', '才', '傷', '食', '劫', '比', '印', '梟'], ['10', '戌', '才', '財', '食', '伤', '比', '劫', '梟', '印', '殺', '官'], ['11', '亥', '梟', '印', '殺', '官', '才', '財', '食', '傷', '比', '劫']);
        this.huoTuDiYunTB = new Array(['0', '子', '浴', '病', '胎', '绝', '胎', '绝', '死', '生', '旺', '禄'], ['1', '丑', '冠', '衰', '养', '墓', '养', '墓', '墓', '养', '衰', '冠'], ['2', '寅', '禄', '旺', '生', '死', '生', '死', '绝', '胎', '病', '浴'], ['3', '卯', '旺', '禄', '浴', '病', '浴', '病', '胎', '绝', '死', '生'], ['4', '辰', '衰', '冠', '冠', '衰', '冠', '衰', '养', '墓', '墓', '养'], ['5', '巳', '病', '浴', '禄', '旺', '禄', '旺', '生', '死', '绝', '胎'], ['6', '午', '死', '生', '旺', '禄', '旺', '禄', '浴', '病', '胎', '绝'], ['7', '未', '墓', '养', '衰', '冠', '衰', '冠', '冠', '衰', '养', '墓'], ['8', '申', '绝', '胎', '病', '浴', '病', '浴', '禄', '旺', '生', '死'], ['9', '酉', '胎', '绝', '死', '生', '死', '生', '旺', '禄', '浴', '病'], ['10', '戌', '养', '墓', '墓', '养', '墓', '养', '衰', '冠', '冠', '衰'], ['11', '亥', '生', '死', '绝', '胎', '绝', '胎', '病', '浴', '禄', '旺']);
        this.shuiTuDiYunTB = new Array(['0', '子', '浴', '病', '胎', '绝', '旺', '禄', '死', '生', '旺', '禄'], ['1', '丑', '冠', '衰', '养', '墓', '衰', '冠', '墓', '养', '衰', '冠'], ['2', '寅', '禄', '旺', '生', '死', '病', '浴', '绝', '胎', '病', '浴'], ['3', '卯', '旺', '禄', '浴', '病', '死', '生', '胎', '绝', '死', '生'], ['4', '辰', '衰', '冠', '冠', '衰', '墓', '养', '养', '墓', '墓', '养'], ['5', '巳', '病', '浴', '禄', '旺', '绝', '胎', '生', '死', '绝', '胎'], ['6', '午', '死', '生', '旺', '禄', '胎', '绝', '浴', '病', '胎', '绝'], ['7', '未', '墓', '养', '衰', '冠', '养', '墓', '冠', '衰', '养', '墓'], ['8', '申', '绝', '胎', '病', '浴', '生', '死', '禄', '旺', '生', '死'], ['9', '酉', '胎', '绝', '死', '生', '浴', '病', '旺', '禄', '浴', '病'], ['10', '戌', '养', '墓', '墓', '养', '冠', '衰', '衰', '冠', '冠', '衰'], ['11', '亥', '生', '死', '绝', '胎', '禄', '旺', '病', '浴', '禄', '旺']);
        this.zhiCangGanTB = new Array(['0', '子', '1', '癸', '10', '1', '', '0', '0', '', '0', '0', '', ''], ['1', '丑', '3', '己', '6', '0.5', '癸', '10', '0.25', '辛', '8', '0.25', '', ''], ['2', '寅', '3', '甲', '1', '0.5', '丙', '3', '0.25', '戊', '5', '0.25', '', ''], ['3', '卯', '1', '乙', '2', '1', '', '0', '0', '', '0', '0', '', ''], ['4', '辰', '3', '戊', '5', '0.5', '乙', '2', '0.25', '癸', '10', '0.25', '', ''], ['5', '巳', '3', '丙', '3', '0.5', '戊', '5', '0.25', '庚', '7', '0.25', '', ''], ['6', '午', '2', '丁', '4', '0.667', '己', '6', '0.333', '', '0', '0', '', ''], ['7', '未', '3', '己', '6', '0.5', '丁', '4', '0.25', '乙', '2', '0.25', '', ''], ['8', '申', '3', '庚', '7', '0.5', '壬', '9', '0.25', '戊', '5', '0.25', '', ''], ['9', '酉', '1', '辛', '8', '1', '', '0', '0', '', '0', '0', '', ''], ['10', '戌', '3', '戊', '5', '0.5', '辛', '8', '0.25', '丁', '4', '0.25', '', ''], ['11', '亥', '2', '壬', '9', '0.667', '甲', '1', '0.333', '', '0', '0', '', '']);
        this.tianGanCommentTB = new Array(['0', '甲', '甲木參天，脫胎要火。春不容金，秋不容土。火熾乘龍（辰月），水宕騎虎（寅月）。地潤天和，植立千古。'], ['1', '乙', '乙木雖柔，刈羊【未己】解牛【丑己】。懷丁抱丙，跨鳳【酉】乘猴【申】。虛濕【亥子】之地，騎馬【午】亦憂。藤蘿【寅】系甲，可春可秋。'], ['2', '丙', '丙火猛烈，欺霜【秋】侮雪【冬】。能煆庚金，逢辛反怯。土眾成慈，水猖顯節。虎馬犬【寅午戌化火】鄉，甲木若來，必當焚滅。'], ['3', '丁', '丁火柔中，內性昭融。抱乙而孝，合壬而忠。旺而不烈，衰而不窮，如有嫡母【甲】，可秋可冬。'], ['4', '戊', '戊土固重，既中且正。靜翕（秋冬）動辟（春夏），萬物司命。水潤（春夏）物生，火燥（秋冬）物病。若在艮坤【寅申】，怕沖宜靜。'], ['5', '己', '己土卑濕，中正蓄藏。不愁木盛，不畏水狂。火少火晦，金多金光。若要物旺，宜助【戊己】宜幫【丙】。'], ['6', '庚', '庚金帶煞，剛健為最。得水而清【壬】，得火而銳【丁】。土潤則生【丑辰己土】，土干則脆【未戌戊土】。能贏甲兄，輸於乙妹。'], ['7', '辛', '辛金軟弱，溫潤而清。畏土之疊【戊己】，樂水【壬癸】之盈。能扶社稷【合丙救甲】，能救生靈【合丙潤戊】。熱則喜母【己晦火而生金】，寒則喜丁【溫水而養金】。'], ['8', '壬', '壬水通河，能泄金氣【申】，剛中之德，周流不滯。通根透癸【申子辰】，沖天奔地。化則有情【順勢化木】，從【火土】則相濟。【丁壬合木，淫暱之合】【丙壬衝】'], ['9', '癸', '癸水至弱，達於天津。得龍【辰】而運，功化斯神。不愁火土，不論庚辛。合戊見火，化象斯真。']);
        this.jieQiInfoTB = new Array(['1', '立春', '13', '-45', '水瓶座', '♒️'], ['2', '雨水', '14', '-30', '双鱼座', '♓️'], ['3', '惊蛰', '15', '-15', '双鱼座', '♓️'], ['4', '春分', '16', '0', '白羊座', '♈️'], ['5', '清明', '17', '15', '白羊座', '♈️'], ['6', '谷雨', '18', '30', '金牛座', '♉️'], ['7', '立夏', '19', '45', '金牛座', '♉️'], ['8', '小满', '20', '60', '双子座', '♊️'], ['9', '芒种', '21', '75', '双子座', '♊️'], ['10', '夏至', '22', '90', '巨蟹座', '♋️'], ['11', '小暑', '23', '105', '巨蟹座', '♋️'], ['12', '大暑', '24', '120', '狮子座', '♌️'], ['13', '立秋', '1', '135', '狮子座', '♌️'], ['14', '处暑', '2', '150', '处女座', '♍️'], ['15', '白露', '3', '165', '处女座', '♍️'], ['16', '秋分', '4', '180', '天秤座', '♎️'], ['17', '寒露', '5', '195', '天秤座', '♎️'], ['18', '霜降', '6', '210', '天蝎座', '♏️'], ['19', '立冬', '7', '225', '天蝎座', '♏️'], ['20', '小雪', '8', '240', '射手座', '♐️'], ['21', '大雪', '9', '255', '射手座', '♐️'], ['22', '冬至', '10', '270', '摩羯座', '♑️'], ['23', '小寒', '11', '285', '摩羯座', '♑️'], ['24', '大寒', '12', '300', '水瓶座', '♒️']);
        this.tiaoHouYongShenTB = new Array(['甲木子月：木性生寒，丁先庚后，丙火为佐，必须支见巳寅，方为贵格。'], ['甲木丑月：丁火必不可少，通根巳寅，甲木为助，用庚劈甲引丁。'], ['甲木寅月：调合气候为要，丙火为主，癸水为佐。'], ['甲木卯月：阳刃驾杀，专用庚金，以戊己滋杀为佐。无庚，用丙丁泄秀，不取制杀。'], ['甲木辰月：用金必须丁火制之，为伤官制杀。无庚用壬。'], ['甲木巳月：调合气候，癸水为主。原局气润，庚丁为用。'], ['甲木午月：木性虚焦，癸为主要。无癸用丁，亦宜运行北地。'], ['甲木未月：上半月同五月用癸，下半月用庚丁。'], ['甲木申月：先用庚，再取丁，为伤官制杀，无丁用壬，富而不贵。'], ['甲木酉月：用丁制杀，用丙调候，丁丙并用为佐。'], ['甲木戌月：土旺者用甲木，木旺者用庚金，丁壬癸为佐。'], ['甲木亥月：用庚金，取丁火制之，丙火调候。水旺用戊。'], ['乙木子月：寒木向阳，专用丙火，忌见癸水。'], ['乙木丑月：寒谷回春，专用丙火。'], ['乙木寅月：取丙火解寒，略取癸水为滋润，不宜困丙。'], ['乙木卯月：以癸滋木，用丙泄秀，不宜见金。'], ['乙木辰月：若支成水局，取戊为佐。'], ['乙木巳月：月令丙火得禄，专用癸水，调候为急。'], ['乙木午月：上半月专用癸水，下半月丙癸并用。'], ['乙木未月：润土滋木，喜用癸水，柱多金水，先用丙火。夏月壬癸，切忌戊己杂乱。'], ['乙木申月：月垣庚金司令，取丙火制之，或癸水化之。不论用丙用癸，皆己土为佐。'], ['乙木酉月：上半月癸先丙后，下半月用丙先癸后，无癸用壬。'], ['乙木戌月：以金发水之源。见甲，名藤萝系甲。'], ['乙木亥月：乙木向阳，专用丙火，水多以戊为佐。'], ['丙火子月：气近二阳，丙火弱中复强，故用壬水，取戊制之，无戊用己。'], ['丙火丑月：喜壬为用，土多不可少甲。'], ['丙火寅月：壬水为用，庚金发水之源为佐。'], ['丙火卯月：专用壬水，水多用戊制之，身弱用印化之。'], ['丙火辰月：专用壬水，土重以甲为佐。'], ['丙火巳月：以庚为佐，忌戊制壬。'], ['丙火午月：壬庚以通根申宫为妙。'], ['丙火未月：以庚为佐。'], ['丙火申月：壬水通根申宫，壬多必取戊制。'], ['丙火酉月：四柱多丙，一壬高透为奇。无壬为癸。'], ['丙火戌月：忌土晦光，先取甲疏土，次用壬水。'], ['丙火亥月：月垣壬水秉令，水旺用甲木化之。身杀两旺，用戊制之。火旺用壬，木旺宜庚。'], ['丁火子月：庚金劈甲引丁，甲木为尊，庚金为佐。戊癸权宜取用。'], ['丁火丑月：庚金劈甲引丁，甲木为尊，庚金为佐。戊癸权宜取用。'], ['丁火寅月：用庚金劈甲引丁。'], ['丁火卯月：以庚去乙，以甲引丁。'], ['丁火辰月：以甲木引丁制土，次看庚金。木盛用庚，水盛用戊。'], ['丁火巳月：取甲引丁，甲多又取庚为先。'], ['丁火午月：火多以庚壬两透为贵。无壬用癸，为独杀当权。'], ['丁火未月：以甲木化壬引丁为用，用甲不能无庚，取庚为佐。'], ['丁火申月：庚取劈甲，无甲用乙。用丙暖金晒甲，无庚甲而用乙者，见丙为枯草引灯。水旺用戊。'], ['丁火酉月：庚取劈甲，无甲用乙。用丙暖金晒甲，无庚甲而用乙者，见丙为枯草引灯。水旺用戊。'], ['丁火戌月：一派戊土无甲，为伤官尽。'], ['丁火亥月：庚金劈甲引丁，甲木为尊，庚金为佐。戊癸权宜取用。'], ['戊土子月：丙火为尚，甲木为佐。'], ['戊土丑月：丙火为尚，甲木为佐。'], ['戊土寅月：无丙照暖，戊土不生，无甲疏劈，戊土不灵，无癸兹润，戊土不长。先丙、次甲、次癸。'], ['戊土卯月：无丙照暖，戊土不生，无甲疏劈，戊土不灵，无癸兹润，戊土不长。先丙、次甲、次癸。'], ['戊土辰月：戊土司令，先用甲疏，次丙、次癸。'], ['戊土巳月：戊土建禄，先用甲疏劈，次取丙癸。'], ['戊土午月：调候为急，先用壬水，次取甲木，丙火酌用。'], ['戊土未月：调候为急，癸不可缺，次用丙火，土重不能无甲。'], ['戊土申月：寒气渐增，先用丙火，后用癸水。水多，用甲泄之。'], ['戊土酉月：赖丙照暖，喜水滋润。'], ['戊土戌月：戊土当权，先用甲木，次取丙火。见金，先用癸水，后取丙火。'], ['戊土亥月：非甲不灵，非丙不暖。'], ['己土子月：三冬己土，非丙暖不生。壬水太旺，取戊土制之，土多，取甲木疏之。'], ['己土丑月：三冬己土，非丙暖不生。壬水太旺，取戊土制之，土多，取甲木疏之。'], ['己土寅月：取丙解寒，忌见壬水，如水多，须以土为佐。土多用甲，甲多用庚。'], ['己土卯月：用甲忌与己土合化，次用癸水润之。'], ['己土辰月：先丙后癸，土暖而润，随用甲疏。'], ['己土巳月：调候不能无癸，土润不能无丙。'], ['己土午月：调候不能无癸，土润不能无丙。'], ['己土未月：调候不能无癸，土润不能无丙。'], ['己土申月：丙火温土，癸水润土。七月庚金司令，丙能制金，癸能泄金。'], ['己土酉月：取辛辅癸。'], ['己土戌月：九月土盛，宜甲木疏之，次用丙癸。'], ['己土亥月：三冬己土，非丙暖不生。初冬壬旺，取戊土制之，土多，取甲木疏之。'], ['庚金子月：仍取丁甲，次取丙火照暖，丙丁须临寅巳午未戌支，方为有力。一派金水，不入和暖之乡，孤贫。'], ['庚金丑月：仍须丁甲，次取丙火照暖，丙丁须临寅巳午未戌支，方为有力。一派金水，不入和暖之乡，孤贫。'], ['庚金寅月：用丙暖庚性，患土厚埋金，须甲疏泄。火多用土，支成火局用壬。'], ['庚金卯月：庚金暗强，专用丁火，借甲引丁，用庚劈甲。无丁用丙。'], ['庚金辰月：顽金宜丁，旺土用甲，不用庚劈。支火宜癸，干火宜壬。'], ['庚金巳月：丙不熔金，惟喜壬制。次取戊土，丙火为佐。支成金局，变弱为强，须用丁火。'], ['庚金午月：专用壬水，癸次之，须支见庚辛为助。无壬癸，用戊己泄火之气。'], ['庚金未月：若支成土局，甲先丁后。'], ['庚金申月：专用丁火，以甲引丁。'], ['庚金酉月：用丁火煅金，兼用丙火调候。'], ['庚金戌月：土厚先用甲疏，次用壬洗。'], ['庚金亥月：水冷金寒爱丙丁，甲木辅丁。'], ['辛金子月：冬月辛金，不能缺丙火温暖，余皆酌用。'], ['辛金丑月：同上。丙先壬后，戊己次之，总之丙火不可少也。'], ['辛金寅月：辛金失令，取己土为生身之本，欲得辛金发用，全赖壬水之功。壬己并用，以庚为助。'], ['辛金卯月：壬水为尊，见戊己为病，须甲制伏。'], ['辛金辰月：若见丙火合辛，须有癸制丙。支见亥子申，为贵。'], ['辛金巳月：壬水淘洗，兼有调候之用，更有甲木制戊，一清彻底。'], ['辛金午月：己无壬不湿，辛无己不生，故壬己并用，无壬用癸。'], ['辛金未月：先用壬水，取庚为佐，忌戊出，得甲制之，方吉。'], ['辛金申月：壬水为尊，甲戊酌用。不可用癸水。'], ['辛金酉月：壬水淘洗，如见戊己，须甲制土。支成金局，无壬，须用丁火。'], ['辛金戌月：九月辛金，火土为病，水木为用。'], ['辛金亥月：先壬后丙，名金白水清，余皆酌用。'], ['壬水子月：水旺宜戊，调候宜丙，丙戊必须兼用。'], ['壬水丑月：上半月专用丙火，下半月用丙，甲木为佐。'], ['壬水寅月：无比劫，不必用戊，专用庚金，丙火为佐。'], ['壬水卯月：三春壬水绝地，取庚辛发水之源，水多用戊。'], ['壬水辰月：甲疏季土，次取庚金以发水源，金多须丙制之为妙。'], ['壬水巳月：壬水弱极，取庚辛为源，壬癸比助。'], ['壬水午月：取庚为源，取癸为佐，无庚用辛。'], ['未月以辛：金发水源，甲木疏土。'], ['壬水申月：取丁火佐戊制庚，戊土通根辰戌，丁火通根午戌，方可为用。'], ['壬水酉月：无甲，用金发水之源，名独水犯庚辛，体全之义。'], ['壬水戌月：以甲制戌中戊土，丙火为佐。'], ['壬水亥月：若甲出制戊，须以庚金为救。'], ['癸水子月：丙火解冻，辛金滋扶'], ['癸水丑月：丙火解冻，通根寅巳午未戌方妙。支成金局，要丙透得地。支成火局，又宜用庚辛。'], ['癸水寅月：用辛生癸水为源，无辛用庚。丙不可少。'], ['癸水卯月：乙木司令，专用庚金，辛金为次。'], ['癸水辰月：上半月专用丙火，下半月虽用丙火，辛甲为佐。'], ['癸水巳月：无辛用庚。忌丁破格，有壬可免。'], ['癸水午月：庚辛为生身之本，但丁火司权，金难敌火，宜兼有比劫，方得庚辛之用。'], ['癸水未月：上半月金神衰弱，火气炎热，宜比劫帮身，同五月。下半月无比劫亦可。'], ['癸水申月：庚金得禄，必丁火制金为用，丁火以通根午戌未为妙。'], ['癸水酉月：辛金为用，丙火佐之，名水暖金温，须隔位同透为妙。'], ['癸水戌月：专用辛金，忌戊土，要比劫兹甲制戊方妙。'], ['癸水亥月：亥中甲木长生，泄散元神，宜用庚辛。水多用戊，金多用丁。']);
    }
    getGanYinYang(ganNo) {
        if (this.tianGan[ganNo - 1][2] == '0') {
            return true;
        }
        else
            return false;
    }
    getZhiYinYang(zhiNo) {
        if (this.diZhi[zhiNo - 1][2] == '0') {
            return true;
        }
        else
            return false;
    }
    getYear2GanNo(yearNo) {
        let vYearTemp = yearNo;
        if (vYearTemp < 0) {
            vYearTemp = vYearTemp + 12001;
        }
        else {
            vYearTemp = vYearTemp + 120;
        }
        return ((vYearTemp + 6) % 10 + 1);
    }
    getYear2GanName(yearNo) {
        let vYearTemp = yearNo;
        if (vYearTemp < 0) {
            vYearTemp = vYearTemp + 12001;
        }
        else {
            vYearTemp = vYearTemp + 120;
        }
        return this.tianGan[(vYearTemp + 6) % 10][1];
    }
    getGanName(ganNo) {
        return this.tianGan[ganNo - 1][1];
    }
    getTianGanComment(ganNo) {
        return this.tianGanCommentTB[ganNo - 1][2];
    }
    getYear2ZhiNo(yearNo) {
        let vYearTemp = yearNo;
        if (vYearTemp < 0) {
            vYearTemp = vYearTemp + 12001;
        }
        else {
            vYearTemp = vYearTemp + 120;
        }
        return ((vYearTemp + 8) % 12 + 1);
    }
    getYear2ZhiName(yearNo) {
        let vYearTemp = yearNo;
        if (vYearTemp < 0) {
            vYearTemp = vYearTemp + 12001;
        }
        else {
            vYearTemp = vYearTemp + 120;
        }
        return this.diZhi[(vYearTemp + 8) % 12][1];
    }
    getZhiName(zhiNo) {
        return this.diZhi[zhiNo - 1][1];
    }
    getYear2GanZhiNo(yearNo) {
        let vYearTemp = yearNo;
        if (vYearTemp < 0) {
            vYearTemp = vYearTemp + 12001;
        }
        else {
            vYearTemp = vYearTemp + 120;
        }
        return ((vYearTemp + 56) % 60 + 1);
    }
    getYear2GanZhiName(yearNo) {
        let vYearTemp = yearNo;
        if (vYearTemp < 0) {
            vYearTemp = vYearTemp + 12001;
        }
        else {
            vYearTemp = vYearTemp + 120;
        }
        return this.ganZhi[(vYearTemp + 56) % 60][1];
    }
    getGanZhiNo(ganNo, zhiNo) {
        return this.getZhuNoByGanZhiNo(ganNo, zhiNo);
    }
    getZhuNoByGanZhiNo(ganNo1, zhiNo1) {
        let ganZhiNo = 1;
        let ganNo = Number(ganNo1);
        let zhiNo = Number(zhiNo1);
        if (ganNo < 1) {
            ganNo += 10;
        }
        else if (ganNo > 10) {
            ganNo -= 10;
        }
        if (zhiNo < 1) {
            zhiNo += 12;
        }
        else if (zhiNo > 12) {
            zhiNo -= 12;
        }
        if (ganNo == zhiNo) {
            ganZhiNo = ganNo;
        }
        else if (ganNo < zhiNo) {
            ganZhiNo = Math.abs((zhiNo - ganNo - 12) * 5) + ganNo;
        }
        else {
            ganZhiNo = (ganNo - zhiNo) * 5 + ganNo;
        }
        if (ganZhiNo < 1) {
            ganZhiNo += 60;
        }
        else if (ganZhiNo > 60) {
            ganZhiNo -= 60;
        }
        return ganZhiNo;
    }
    getGanZhiNameByZhuNo(ganZhiNo1) {
        let ganZhiNo = Number(ganZhiNo1);
        if (ganZhiNo < 1) {
            ganZhiNo += 60;
        }
        else if (ganZhiNo > 60) {
            ganZhiNo -= 60;
        }
        return this.ganZhi[ganZhiNo - 1][1];
    }
    getZhuNameByGanZhiNo(ganNo, zhiNo) {
        let ganZhiNo = this.getZhuNoByGanZhiNo(ganNo, zhiNo);
        return this.ganZhi[ganZhiNo - 1][1];
    }
    getGanNoByZhuNo(ZhuNo) {
        return Number(this.ganZhi[ZhuNo - 1][4]);
    }
    getZhiNoByZhuNo(ZhuNo) {
        return Number(this.ganZhi[ZhuNo - 1][6]);
    }
    getNaYinWuXing(ganZhiNo) {
        return this.ganZhi[ganZhiNo - 1][8];
    }
    getNaYin(ganZhiNo) {
        return (this.ganZhi[ganZhiNo - 1][7] + this.ganZhi[ganZhiNo - 1][8]);
    }
    getGanShen(ganNo, riGanNo) {
        return this.ganShenTB[ganNo - 1][riGanNo + 1];
    }
    getZhiShen(zhiNo, riGanNo) {
        return this.zhiShenTB[zhiNo - 1][riGanNo + 1];
    }
    getZhiCangGanNo(zhiNo) {
        let cangGanNum = Number(this.zhiCangGanTB[zhiNo - 1][2]);
        let cangGan1No = 1;
        let cangGan2No = 1;
        let cangGan3No = 1;
        cangGan1No = Number(this.zhiCangGanTB[zhiNo - 1][4]);
        if (cangGanNum == 2) {
            cangGan2No = Number(this.zhiCangGanTB[zhiNo - 1][7]);
        }
        else if (cangGanNum == 3) {
            cangGan2No = Number(this.zhiCangGanTB[zhiNo - 1][7]);
            cangGan3No = Number(this.zhiCangGanTB[zhiNo - 1][10]);
        }
        return [cangGanNum, cangGan1No, cangGan2No, cangGan3No];
    }
    getZhiCangGanName(zhiNo) {
        let cangGanNum = Number(this.zhiCangGanTB[zhiNo - 1][2]);
        let cangGan1Name = "";
        let cangGan2Name = "";
        let cangGan3Name = "";
        cangGan1Name = this.zhiCangGanTB[zhiNo - 1][3];
        if (cangGanNum == 2) {
            cangGan2Name = this.zhiCangGanTB[zhiNo - 1][6];
        }
        else if (cangGanNum == 3) {
            cangGan2Name = this.zhiCangGanTB[zhiNo - 1][6];
            cangGan3Name = this.zhiCangGanTB[zhiNo - 1][9];
        }
        return [cangGanNum, cangGan1Name, cangGan2Name, cangGan3Name];
    }
    getHuoTuDiYun(zhiNo, riGanNo) {
        return this.huoTuDiYunTB[zhiNo - 1][riGanNo + 1];
    }
    getShuiTuDiYun(zhiNo, riGanNo) {
        return this.shuiTuDiYunTB[zhiNo - 1][riGanNo + 1];
    }
    getMonthZhuNameByYearGanNo(yearGanNo, monthZhiNo) {
        let yearNo = Number(yearGanNo) - 1;
        let monthNo = Number(monthZhiNo) - 1;
        return this.byYear2MonthZhuNameArr[yearNo][monthNo];
    }
    getMonthZhuNoByYearGanNo(yearGanNo, monthZhiNo) {
        let yearNo = Number(yearGanNo) - 1;
        let monthNo = Number(monthZhiNo) - 1;
        return Number(this.byYear2MonthZhuNoArr[yearNo][monthNo]);
    }
    getTimeZhuNameByDayGanNo(dayGanNo, timeZhiNo) {
        let dayNo = Number(dayGanNo) - 1;
        let timeNo = Number(timeZhiNo) - 1;
        return this.byDay2TimeZhuNameArr[dayNo][timeNo];
    }
    getTimeZhuNoByDayGanNo(dayGanNo, timeZhiNo) {
        let dayNo = Number(dayGanNo) - 1;
        let timeNo = Number(timeZhiNo) - 1;
        return Number(this.byDay2TimeZhuNoArr[dayNo][timeNo]);
    }
    getZhuInfo(zhuName, zhuNo, riGanNo = 1, daYunYearStr = '', daYunSuiStr = '') {
        let zhuInfo = new Object;
        zhuInfo.Name = zhuName;
        zhuInfo.No = zhuNo;
        if ((zhuNo % 2) == 0) {
            zhuInfo.yinYang = false;
        }
        else {
            zhuInfo.yinYang = true;
        }
        if (zhuInfo.No < 1) {
            zhuInfo.No = zhuInfo.No + 60;
        }
        else if (zhuInfo.No > 60) {
            zhuInfo.No = zhuInfo.No - 60;
        }
        zhuInfo.GanZhi = this.ganZhi[zhuInfo.No - 1][1];
        zhuInfo.Gan = this.ganZhi[zhuInfo.No - 1][3];
        zhuInfo.GanNo = Number(this.ganZhi[zhuInfo.No - 1][4]);
        zhuInfo.GanShen = this.getGanShen(zhuInfo.GanNo, riGanNo);
        zhuInfo.Zhi = this.ganZhi[zhuInfo.No - 1][5];
        zhuInfo.ZhiNo = Number(this.ganZhi[zhuInfo.No - 1][6]);
        zhuInfo.ZhiShen = this.getZhiShen(zhuInfo.ZhiNo, riGanNo);
        zhuInfo.daYunYearNumStr = daYunYearStr;
        zhuInfo.daYunSuiNumStr = daYunSuiStr;
        zhuInfo.cangGanNum = this.getZhiCangGanNo(zhuInfo.ZhiNo)[0];
        zhuInfo.cangGan1No = this.getZhiCangGanNo(zhuInfo.ZhiNo)[1];
        zhuInfo.cangGan2No = this.getZhiCangGanNo(zhuInfo.ZhiNo)[2];
        zhuInfo.cangGan3No = this.getZhiCangGanNo(zhuInfo.ZhiNo)[3];
        zhuInfo.cangGan1Name = this.getZhiCangGanName(zhuInfo.ZhiNo)[1];
        zhuInfo.cangGan2Name = this.getZhiCangGanName(zhuInfo.ZhiNo)[2];
        zhuInfo.cangGan3Name = this.getZhiCangGanName(zhuInfo.ZhiNo)[3];
        zhuInfo.cangGanName = zhuInfo.cangGan1Name + zhuInfo.cangGan2Name + zhuInfo.cangGan3Name;
        zhuInfo.cangGanShen1 = this.getGanShen(zhuInfo.cangGan1No, riGanNo);
        zhuInfo.cangGanShen2 = this.getGanShen(zhuInfo.cangGan2No, riGanNo);
        zhuInfo.cangGanShen3 = this.getGanShen(zhuInfo.cangGan3No, riGanNo);
        if (zhuInfo.cangGanNum == 2) {
            zhuInfo.cangGanShen3 = '';
        }
        else if (zhuInfo.cangGanNum == 1) {
            zhuInfo.cangGanShen2 = '';
            zhuInfo.cangGanShen3 = '';
        }
        zhuInfo.cangGanShen = zhuInfo.cangGanShen1 + zhuInfo.cangGanShen2 + zhuInfo.cangGanShen3;
        zhuInfo.HuoTuDiYun = this.getHuoTuDiYun(zhuInfo.ZhiNo, riGanNo);
        zhuInfo.ZhuHuoTuDiYun = this.getHuoTuDiYun(zhuInfo.ZhiNo, zhuInfo.GanNo);
        zhuInfo.ShuiTuDiYun = this.getShuiTuDiYun(zhuInfo.ZhiNo, riGanNo);
        zhuInfo.ZhuShuiTuDiYun = this.getShuiTuDiYun(zhuInfo.ZhiNo, zhuInfo.GanNo);
        zhuInfo.NaYinWuXing = this.ganZhi[zhuInfo.No - 1][8];
        zhuInfo.NaYin = this.ganZhi[zhuInfo.No - 1][7] + this.ganZhi[zhuInfo.No - 1][8];
        zhuInfo.XunNo = Number(this.ganZhi[zhuInfo.No - 1][9]);
        zhuInfo.XunKong1 = this.ganZhi[zhuInfo.No - 1][10];
        zhuInfo.XunKong1No = Number(this.ganZhi[zhuInfo.No - 1][11]);
        zhuInfo.XunKong2 = this.ganZhi[zhuInfo.No - 1][12];
        zhuInfo.XunKong2No = Number(this.ganZhi[zhuInfo.No - 1][13]);
        zhuInfo.XunKong = this.ganZhi[zhuInfo.No - 1][10] + this.ganZhi[zhuInfo.No - 1][12];
        return zhuInfo;
    }
    getZhuInfoByGanZhi(zhuName, ganNo, zhiNo, riGanNo) {
        let ganZhiNo = this.getZhuNoByGanZhiNo(ganNo, zhiNo);
        return this.getZhuInfo(zhuName, ganZhiNo, riGanNo);
    }
    getJieQiName(jieQiNo) {
        return this.jieQiInfoTB[jieQiNo - 1][2];
    }
    getMonthJieQiJD(year, monthDiZhiNo) {
        let yearTemp = year;
        let jieQiStartNo = monthDiZhiNo * 2 - 5;
        let JD0 = new Object();
        if (jieQiStartNo < 1) {
            yearTemp -= 1;
            jieQiStartNo += 24;
        }
        JD0.startJD = JD.getJieQiNo2JD(yearTemp, jieQiStartNo).JD2;
        JD0.midJD = JD.getJieQiNo2JD(yearTemp, jieQiStartNo).JD3;
        JD0.endJD = JD.getJieQiNo2JD(yearTemp, jieQiStartNo).JD4;
        return JD0;
    }
    getConstellation(jieQiNo) {
        return [this.jieQiInfoTB[jieQiNo - 1][4], this.jieQiInfoTB[jieQiNo - 1][5], String(this.jieQiInfoTB[jieQiNo - 1][4], this.jieQiInfoTB[jieQiNo - 1][5])];
    }
    getConstellationByJD(JD) {
        return this.getConstellation(qiQiNo);
    }
    getTiaoHouYongShen(tianGanNo, yueZhiNo) {
        return this.tiaoHouYongShenTB[(tianGanNo - 1) * 12 + (yueZhiNo - 1)];
    }
}
var wuXingGZSys = new _WuXingGanZhiSystem_();
